package com.gmail.takashi316.tminchart;

import java.util.Random;

/**
 * Created by sasaki on 2015/03/02.
 */
public class DailyChineseCharacter {

    public static DailyChineseCharacter getInstance() {
        if (dailyChineseCharacter == null) {
            dailyChineseCharacter = new DailyChineseCharacter();
        }//if
        return dailyChineseCharacter;
    }//getInstance

    private Random random = new Random();
    private static DailyChineseCharacter dailyChineseCharacter;

    private final static String[] strings = new String[]
            {
                    "一乙",
                    "九七十人丁刀二入八又了力",
                    "下干丸久及弓巾己乞口工才三山士子女小上丈刃寸千川大土亡凡万夕与",
                    "井引円王化火牙介刈牛凶斤区欠月犬元幻戸五互午公勾孔今支止氏尺手収升少冗心仁水切双太丹中弔爪天斗屯内匂日反比匹不夫父仏分文片方乏毛木厄友予六",
                    "圧以右永凹央加可外且瓦刊甘丘旧去巨玉句兄穴玄古功巧広甲号込左冊札皿仕司史四市示叱失写主囚汁出処召尻申世正生斥石仙占他打代台旦庁田奴冬凸尼白半氾犯皮必氷付布払丙平辺弁母包北本末未民矛目矢由幼用立令礼丼",
                    "扱安衣芋印因宇羽臼汚仮会回灰各汗缶企伎危机気吉休吸朽共叫仰曲刑血件交光向后好江考行合再在旨死糸至字寺次耳自式芝守朱州舟充旬巡匠色尽迅成西舌先全壮早争存多宅団地池竹仲虫兆伝吐灯当同弐肉如任年肌伐帆汎妃百伏米忙朴毎名妄有羊吏両列劣老",
                    "亜位囲医壱応沖何花我快戒改貝角完肝含岐希忌汽技却求究狂局均近吟串君形系芸迎決見言呉坑孝抗攻更克告困佐沙災材坂阪作伺志私似児社車寿秀住初助序床抄肖条状伸臣芯身辛図吹杉声赤折走即束足村汰妥体対択沢但谷男町沈低呈廷弟努投豆那尿妊忍把売伯麦抜伴判否批尾肘扶兵別返芳邦坊妨忘防没妙戻冶役余妖抑沃来乱卵利里良冷励呂労弄",
                    "宛依委易育雨泳英延沿炎往押旺欧殴岡価佳果河苛画芽怪拐劾拡学岳官岸玩岩奇祈季宜泣居拒拠享京供協況金苦具空屈径茎券肩弦呼固股虎効幸拘肯刻国昆妻采刷参使刺始姉枝祉肢事侍治実舎者邪若取受呪周宗叔述所尚承招昇松沼垂炊枢制姓征性青斉昔析拙狙阻卒卓拓担知宙忠抽注長直坪定底抵邸泥的迭典店妬東到毒突届奈乳念波拝杯拍泊迫板版彼披泌肥非表苗府怖阜附侮武服沸物併並歩奉宝抱放法泡房肪牧奔妹枚枕抹味岬命明免茂盲門夜弥油林例炉和枠刹拉",
                    "哀威為畏胃茨咽姻映栄疫怨屋卸音科架悔海界皆垣柿革括活冠巻看紀軌客虐逆急級糾峡挟狭軍係型契計建研県限孤弧故枯後侯厚恒洪皇紅荒郊香拷恨査砂砕咲削昨柵拶姿思指施持室狩首拾秋臭柔重祝俊春盾叙昭省乗城浄拭食信侵神甚帥是政星牲窃宣専泉浅洗染前祖奏相草荘送促則俗耐待怠胎退単炭胆段茶昼柱挑勅珍津追亭貞帝訂点度怒逃洞峠独栃南虹派背肺畑発卑飛眉美秒品負赴封風柄変便保胞某冒勃盆昧迷面約柳勇幽洋要律侶厘郎訃",
                    "挨案員院唄浦益悦宴翁俺恩夏家荷華蚊害格核株釜陥既帰記起飢鬼宮挙恐恭胸脅桑訓郡恵桁倹兼剣拳軒原個庫娯悟候校耕航貢降高剛骨根唆差座挫宰栽剤財索桜殺桟蚕残師紙脂時疾射借酌弱殊珠酒修従准殉純書徐除宵将消症祥称笑辱唇娠振浸真針陣粋衰畝凄逝隻席脊扇栓租素倉捜挿造息捉速袖孫帯泰託値恥致畜逐秩衷酎捗朕通庭逓哲展徒途倒党凍唐島桃討透胴匿特悩納能破馬俳配倍梅班畔般疲秘被姫俵病浜敏浮粉紛陛勉捕倣俸峰砲剖紡埋脈眠娘冥耗紋容浴流留竜旅料倫涙烈恋連朗浪脇哺恣蜑",
                    "悪尉異移萎域逸淫陰液黄菓貨械崖涯殻郭掛喝渇乾勘患貫眼基寄規亀偽菊脚救球虚許魚強教郷菌偶掘啓掲渓経蛍健険現舷康控梗黒頃婚混痕紺彩採済祭斎細菜崎埼惨産斬視鹿執捨赦斜蛇釈寂授終習週渋宿淑粛術庶商唱渉章紹訟剰常情深紳進推酔崇据清盛惜戚責接設雪旋船措曽粗組爽掃曹巣窓側族唾堆袋逮第脱探淡断窒著帳張彫眺頂鳥陳釣停偵笛添転都悼盗陶動堂得豚軟猫捻粘脳婆排敗培陪舶販票描貧瓶婦符部副閉偏崩訪望堀麻密務猛問野訳唯悠郵庸欲翌梨理陸率略粒隆涼猟陵累惧羞貪",
                    "握偉椅飲渦運雲営詠越援奥温過賀絵開階街覚割葛寒喚堪換敢棺款間閑喜幾揮期棋貴欺喫給距暁極勤琴筋遇隅敬景軽結圏堅検減湖雇御喉慌港硬絞項詐最裁策傘散紫詞歯滋軸湿煮就衆集循順暑勝掌晶焼焦硝粧証詔象場畳植殖森診尋須酢遂随晴税絶善然疎訴創喪痩葬装測属尊堕惰替貸隊達棚短弾遅着貯朝超椎痛塚堤提程貼渡登塔搭棟湯痘等答筒統童道鈍廃媒買博斑飯晩番蛮悲扉費備筆媛評富普復幅雰塀遍補募報傍帽棒貿満無婿愉湧猶裕遊雄揚揺葉陽絡落嵐痢硫量塁裂廊惑湾腕喩",
                    "愛暗意違園煙猿遠鉛塩嫁暇禍雅解塊慨蓋該較隔楽滑褐勧寛幹感漢頑棄義詰業僅禁愚虞窟靴群傾携継詣隙傑嫌献絹遣源誇鼓碁溝鉱腰債催塞歳載罪搾嗣詩試資飼慈辞嫉腫愁酬準署傷奨照詳蒸飾触寝慎新腎睡数裾勢聖誠跡摂節戦煎羨腺詮践禅塑僧想賊続損滞滝嘆暖痴稚置蓄腸跳賃艇溺鉄殿電塗働督頓農漠鉢搬煩頒微福腹墓蜂豊飽睦幕夢盟滅誉預溶裸雷酪裏虜鈴零廉賂路楼話賄傲嗅毀彙慄楷蝪",
                    "維稲隠駅演寡歌箇概閣慣管関旗疑漁境銀駆熊語誤構綱酵豪穀酷獄魂際察雑算酸誌雌磁漆遮種需銃塾緒彰障精製誓静説銭漸遡層総遭像増憎遜駄態奪端綻嫡徴漬摘滴適銅徳読認寧髪罰閥碑鼻漂腐複聞蔑慕暮貌僕墨膜慢漫蜜銘鳴綿模網誘様踊僚領緑瑠暦歴練漏瘍箋辣",
                    "慰遺餌影鋭謁閲縁横億稼課餓確潟歓監緩器畿輝儀戯窮緊駒勲慶稽劇撃潔権稿撮賛暫賜質趣熟潤遵諸衝賞嘱審震澄請潜線選遷槽蔵諾誰誕談鋳駐潮調墜潰締敵徹撤踏導憧縄熱罵輩賠箱箸範盤罷膝標賓敷膚賦舞噴墳憤幣弊蔽編舗穂褒暴撲摩魅黙餅憂窯養履璃慮寮輪霊論嘲憬摯踪",
                    "緯衛憶穏壊懐骸獲憾還館機橋興凝錦薫憩激憲賢衡鋼墾錯諮儒樹獣縦壌嬢錠薪親整醒積薦膳操濁壇築諦賭糖頭篤曇燃濃薄縛繁避奮壁縫膨謀磨麺薬諭輸融擁謡頼隣隷錬録緻諧錮鬆",
                    "闇臆嚇轄環擬犠矯謹謙鍵厳講購懇擦謝爵醜縮償礁績繊鮮燥霜戴濯鍛聴謄瞳謎鍋頻優翼覧療瞭齢曖",
                    "穫額顎鎌簡観韓顔騎襟顕験鎖瞬織職繕礎騒贈題懲鎮藤闘難藩覆癖翻繭癒曜濫藍糧臨類璧",
                    "韻艶願鏡繰警鶏鯨璽識蹴髄瀬藻臓覇爆譜簿霧羅離麗麓",
                    "議競響懸護鐘譲醸籍騰欄",
                    "艦顧鶴魔躍露",
                    "驚襲籠",
                    "鑑",
                    "",
                    "",
                    "",
                    "",
                    "",
                    "鬱"
            };

    public int[] nAccumulated = new int[29];

    public DailyChineseCharacter() {
        int n = 0;
        for (int i = 0; i < strings.length; ++i) {
            n += strings[i].length();
            nAccumulated[i] = n;
        }//for
    }//DailyChineseCharacter

    public char getRandomCharOfNStrokes(int n_strokes) {
        final String s = this.strings[n_strokes - 1];
        return s.charAt(random.nextInt(s.length()));
    }//getChar

}//class DailyChineseCharacter

